{
  "plugins": {
    "LuaSnip": {
      "src": "https://github.com/L3MON4D3/LuaSnip.git"
    },
    "blink-copilot": {
      "src": "https://github.com/fang2hou/blink-copilot.git"
    },
    "blink.cmp": {
      "src": "https://github.com/saghen/blink.cmp.git",
      "version": ">=0.0.0"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim.git"
    },
    "copilot-lualine": {
      "src": "https://github.com/AndreM222/copilot-lualine.git"
    },
    "copilot.lua": {
      "src": "https://github.com/zbirenbaum/copilot.lua.git"
    },
    "fidget.nvim": {
      "src": "https://github.com/j-hui/fidget.nvim.git"
    },
    "fzf-lua": {
      "src": "https://github.com/ibhagwan/fzf-lua.git"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim.git"
    },
    "inc-rename.nvim": {
      "src": "https://github.com/smjonas/inc-rename.nvim.git"
    },
    "lualine.nvim": {
      "src": "https://github.com/nvim-lualine/lualine.nvim.git"
    },
    "mason.nvim": {
      "src": "https://github.com/mason-org/mason.nvim.git"
    },
    "mini.nvim": {
      "src": "https://github.com/nvim-mini/mini.nvim.git"
    },
    "nvim-highlight-colors": {
      "src": "https://github.com/brenoprata10/nvim-highlight-colors.git"
    },
    "nvim-navic": {
      "src": "https://github.com/SmiteshP/nvim-navic.git"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter.git"
    },
    "oil.nvim": {
      "src": "https://github.com/stevearc/oil.nvim.git"
    },
    "pangu.vim": {
      "src": "https://github.com/hotoo/pangu.vim.git"
    },
    "persistence.nvim": {
      "src": "https://github.com/folke/persistence.nvim.git"
    },
    "render-markdown.nvim": {
      "src": "https://github.com/MeanderingProgrammer/render-markdown.nvim.git"
    },
    "vim-tmux-navigator": {
      "src": "https://github.com/christoomey/vim-tmux-navigator.git"
    }
  }
}
